# St7SetCombinedLSACombinationFactor

Sets the multiplying factor for the specified case in a linear load case combination for user-generated .LSA files.

long St7SetCombinedLSACombinationFactor(long uID, long Pos, long CaseNum,
double Factor)
Input Parameters
uID
Strand7 model file ID.
Pos
Load case combination number.
CaseNum
Primary result case number.
Factor
Factor value.